In [18]:
import pandas as pd
import numpy as np

In [19]:
ytube=pd.read_csv('D:\shru\SEM 5\ML\\top-5000-youtube-channels.csv')

In [20]:
ytube.head()

,Rank,Grade,Channel name,Video Uploads,Subscribers,Video views
0,1st,A++,Zee TV,82757,18752951,20869786591
1,2nd,A++,T-Series,12661,61196302,47548839843
2,3rd,A++,Cocomelon - Nursery Rhymes,373,19238251,9793305082
3,4th,A++,SET India,27323,31180559,22675948293
4,5th,A++,WWE,36756,32852346,26273668433

In [21]:
ytube.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Rank           5000 non-null   object
 1   Grade          5000 non-null   object
 2   Channel name   5000 non-null   object
 3   Video Uploads  5000 non-null   object
 4   Subscribers    5000 non-null   object
 5   Video views    5000 non-null   int64
dtypes: int64(1), object(5)
memory usage: 234.5+ KB

In [22]:
ytube['Rank']=ytube['Rank'].str[0:-2].str.replace(',','').astype('int')

In [23]:
ytube

,Rank,Grade,Channel name,Video Uploads,Subscribers,Video views
0,1,A++,Zee TV,82757,18752951,20869786591
1,2,A++,T-Series,12661,61196302,47548839843
2,3,A++,Cocomelon - Nursery Rhymes,373,19238251,9793305082
3,4,A++,SET India,27323,31180559,22675948293
4,5,A++,WWE,36756,32852346,26273668433
...,...,...,...,...,...,...
4995,4996,B+,Uras Benlioğlu,706,2072942,441202795
4996,4997,B+,HI-TECH MUSIC LTD,797,1055091,377331722
4997,4998,B+,Mastersaint,110,3265735,311758426
4998,4999,B+,Bruce McIntosh,3475,32990,14563764
4999,5000,B+,SehatAQUA,254,21172,73312511

In [24]:
ytube.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Rank           5000 non-null   int32
 1   Grade          5000 non-null   object
 2   Channel name   5000 non-null   object
 3   Video Uploads  5000 non-null   object
 4   Subscribers    5000 non-null   object
 5   Video views    5000 non-null   int64
dtypes: int32(1), int64(1), object(4)
memory usage: 215.0+ KB

In [25]:
mask1=ytube[ytube['Subscribers'].str.contains('-')].index
ytube.drop(labels=mask1,axis=0,inplace=True)

In [26]:
ytube['Subscribers']=ytube['Subscribers'].astype('int')

In [27]:
ytube.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4613 entries, 0 to 4999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Rank           4613 non-null   int32
 1   Grade          4613 non-null   object
 2   Channel name   4613 non-null   object
 3   Video Uploads  4613 non-null   object
 4   Subscribers    4613 non-null   int32
 5   Video views    4613 non-null   int64
dtypes: int32(2), int64(1), object(3)
memory usage: 216.2+ KB

In [38]:
mask2=ytube[ytube['Video Uploads'].str.contains('-')].index
ytube.drop(labels=mask2,axis=0,inplace=True)
ytube['Video Uploads']= ytube['Video Uploads'].astype('int')

In [39]:
ytube.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4610 entries, 0 to 4999
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Rank           4610 non-null   int32
 1   Grade          4610 non-null   float64
 2   Channel name   4610 non-null   object
 3   Video Uploads  4610 non-null   int32
 4   Subscribers    4610 non-null   int32
 5   Video views    4610 non-null   int64
dtypes: float64(1), int32(3), int64(1), object(1)
memory usage: 198.1+ KB

In [40]:
ytube[ytube['Channel name']=='']

Empty DataFrame
Columns: [Rank, Grade, Channel name, Video Uploads, Subscribers, Video views]
Index: []

In [41]:
ytube['Grade'].unique()

array([5., 4., 3., 2., 1.])

In [42]:
channel_map={'A++ ':5,'A+ ':4,'A ':3,'A- ':2,'B+ ':1}

In [43]:
ytube['Grade']=ytube['Grade'].map(channel_map)

In [44]:
ytube.head()

,Rank,Grade,Channel name,Video Uploads,Subscribers,Video views
0,1,NaN,Zee TV,82757,18752951,20869786591
1,2,NaN,T-Series,12661,61196302,47548839843
2,3,NaN,Cocomelon - Nursery Rhymes,373,19238251,9793305082
3,4,NaN,SET India,27323,31180559,22675948293
4,5,NaN,WWE,36756,32852346,26273668433